Send_to_eSHOP.txt

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding">
  <SOAP-ENV:Header>
    <nseps:endpoints xmlns:nseps="urn:schemas-IBX:/docs/endpoint.nsendpoint" SOAP-ENV:mustUnderstand="true">
      <nseps:to>
        <nseps:address>2d159c46-78fd-1000-a18c-c0a878340001</nseps:address>
      </nseps:to>
      <nseps:from>
        <nseps:address>#TPID#</nseps:address>
      </nseps:from>
    </nseps:endpoints>
    <nsprop:properties xmlns:nsprop="urn:schemas-IBX:/docs/property.nsproperty" SOAP-ENV:mustUnderstand="true">
      <nsprop:identity>139997ab-8406-b29c-150d-7f3ebe3f12e5</nsprop:identity>
      <nsprop:sentAt>2015-09-30T07:34:40Z</nsprop:sentAt>
      <nsprop:expiresAt>2015-09-30T10:25:11+02:00</nsprop:expiresAt>
      <nsprop:topic>Order</nsprop:topic>
    </nsprop:properties>
    <nsproc:process xmlns:nsproc="urn:schemas-IBX:/docs/process.nsprocess" SOAP-ENV:mustUnderstand="true">
      <nsproc:correlationid>e1a77e00-750f-675c-5643-d35b6c12334f</nsproc:correlationid>
    </nsproc:process>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body><Order xmlns="rrn:org.xcbl:schemas/xcbl/v3_5/xcbl35.xsd">
  <OrderHeader>
    <OrderNumber>
      <BuyerOrderNumber>#BuyerPO#</BuyerOrderNumber>
    </OrderNumber>
    <OrderIssueDate>20990101T09:18:11+01:00</OrderIssueDate>
    <OrderReferences>
      <AccountCode>
        <Reference>
          <RefNum>non-catalog</RefNum>
        </Reference>
      </AccountCode>
    </OrderReferences>
    <Purpose>
      <PurposeCoded>Original</PurposeCoded>
    </Purpose>
    <OrderCurrency>
      <Currency>
        <CurrencyCoded>NOK</CurrencyCoded>
      </Currency>
    </OrderCurrency>
    <OrderLanguage>
      <Language>
        <LanguageCoded>no</LanguageCoded>
      </Language>
    </OrderLanguage>
    <OrderDates>
      <RequestedDeliverByDate>20990101T00:00:00</RequestedDeliverByDate>
    </OrderDates>
    <OrderParty>
      <BuyerParty>
        <Party>
          <PartyID>
            <Identifier>
              <Agency>
                <AgencyCoded>AssignedByBuyerOrBuyersAgent</AgencyCoded>
              </Agency>
              <Ident>TIM11746</Ident>
            </Identifier>
          </PartyID>
          <ListOfIdentifier>
            <Identifier>
              <Agency>
                <AgencyCoded>Other</AgencyCoded>
                <AgencyCodedOther>#BuyerTPID#</AgencyCodedOther>
              </Agency>
              <Ident>BuyerTPIDNUMBER</Ident>
            </Identifier>
            <Identifier>
              <Agency>
                <AgencyCoded>EAN</AgencyCoded>
              </Agency>
              <Ident>7080001229573</Ident>
            </Identifier>
          </ListOfIdentifier>
          <NameAddress>
            <Name1>#BILLTONAME#</Name1>
            <Name2></Name2>
            <Street>#BILLTOSTREET#</Street>
            <StreetSupplement1></StreetSupplement1>
            <StreetSupplement2></StreetSupplement2>
            <PostalCode>#BILLTOZIP#</PostalCode>
            <City>#BILLTOCITY#</City>
            <Country>
              <CountryCoded>NO</CountryCoded>
            </Country>
          </NameAddress>
          <OrderContact>
            <Contact>
              <ContactName>#CONTACTNAME#</ContactName>
              <ListOfContactNumber>
                <ContactNumber>
                  <ContactNumberValue>#CONTACTPHONE#</ContactNumberValue>
                  <ContactNumberTypeCoded>TelephoneNumber</ContactNumberTypeCoded>
                </ContactNumber>
                <ContactNumber>
                  <ContactNumberValue>#CONTACTEMAIL#</ContactNumberValue>
                  <ContactNumberTypeCoded>EmailAddress</ContactNumberTypeCoded>
                </ContactNumber>
              </ListOfContactNumber>
            </Contact>
          </OrderContact>
        </Party>
      </BuyerParty>
      <BuyerTaxInformation>
        <PartyTaxInformation>
          <CompanyRegistrationNumber>#COMPANYORG#</CompanyRegistrationNumber>
        </PartyTaxInformation>
      </BuyerTaxInformation>
      <SellerParty>
        <Party>
          <PartyID>
            <Identifier>
              <Agency>
                <AgencyCoded>AssignedByBuyerOrBuyersAgent</AgencyCoded>
              </Agency>
              <Ident>TIM06039</Ident>
            </Identifier>
          </PartyID>
          <ListOfIdentifier>
            <Identifier>
              <Agency>
                <AgencyCoded>Other</AgencyCoded>
                <AgencyCodedOther>SupplierTPID</AgencyCodedOther>
              </Agency>
              <Ident>2d159c46-78fd-1000-a18c-c0a878340001</Ident>
            </Identifier>
            <Identifier>
              <Agency>
                <AgencyCoded>EAN</AgencyCoded>
              </Agency>
              <Ident></Ident>
            </Identifier>
          </ListOfIdentifier>
          <NameAddress>
            <Name1>ATEA AS</Name1>
            <Street>Postboks 6472, Etterstad</Street>
            <PostalCode>0605</PostalCode>
            <City>OSLO</City>
            <Country>
              <CountryCoded>NO</CountryCoded>
            </Country>
          </NameAddress>
          <OrderContact>
            <Contact>
              <ContactName></ContactName>
              <ListOfContactNumber>
                <ContactNumber>
                  <ContactNumberValue>22095000</ContactNumberValue>
                  <ContactNumberTypeCoded>TelephoneNumber</ContactNumberTypeCoded>
                </ContactNumber>
              </ListOfContactNumber>
            </Contact>
          </OrderContact>
        </Party>
      </SellerParty>
      <SellerTaxInformation>
        <PartyTaxInformation>
          <CompanyRegistrationNumber>976239997</CompanyRegistrationNumber>
        </PartyTaxInformation>
      </SellerTaxInformation>
      <ShipToParty>
        <Party>
          <PartyID>
            <Identifier>
              <Agency>
                <AgencyCoded>AssignedByBuyerOrBuyersAgent</AgencyCoded>
              </Agency>
              <Ident>TIM11746</Ident>
            </Identifier>
          </PartyID>
          <ListOfIdentifier>
            <Identifier>
              <Agency>
                <AgencyCoded>EAN</AgencyCoded>
              </Agency>
              <Ident>7080001229573</Ident>
            </Identifier>
          </ListOfIdentifier>
          <NameAddress>
            <Name1>#SHIPTONAME#</Name1>
            <Name2> </Name2>
            <Street>#SHIPTOSTREET#</Street>
            <StreetSupplement1></StreetSupplement1>
            <StreetSupplement2></StreetSupplement2>
            <PostalCode>#SHIPTOZIP#</PostalCode>
            <City>#SHIPTOCITY#</City>
            <Country>
              <CountryCoded>NO</CountryCoded>
            </Country>
          </NameAddress>
        </Party>
      </ShipToParty>
      <BillToParty>
        <Party>
          <PartyID>
            <Identifier>
              <Agency>
                <AgencyCoded>AssignedByBuyerOrBuyersAgent</AgencyCoded>
              </Agency>
              <Ident>TIM00185</Ident>
            </Identifier>
          </PartyID>
          <ListOfIdentifier>
            <Identifier>
              <Agency>
                <AgencyCoded>EAN</AgencyCoded>
              </Agency>
              <Ident></Ident>
            </Identifier>
          </ListOfIdentifier>
          <NameAddress>
            <Name1>#BILLTONAME#</Name1>
            <Name2> </Name2>
            <Street>#BILLTOSTREET#</Street>
            <StreetSupplement1> </StreetSupplement1>
            <StreetSupplement2> </StreetSupplement2>
            <PostalCode>#BILLTOZIP#</PostalCode>
            <City>#BILLTOCITY#</City>
            <Country>
              <CountryCoded>NO</CountryCoded>
            </Country>
          </NameAddress>
        </Party>
      </BillToParty>
    </OrderParty>
    <OrderTermsOfDelivery>
      <TermsOfDelivery>
        <TermsOfDeliveryFunctionCoded>Other</TermsOfDeliveryFunctionCoded>
        <TermsOfDeliveryFunctionCodedOther>Delivered, duty paid</TermsOfDeliveryFunctionCodedOther>
        <ShipmentMethodOfPaymentCoded>Other</ShipmentMethodOfPaymentCoded>
        <ShipmentMethodOfPaymentCodedOther>Delivered, duty paid</ShipmentMethodOfPaymentCodedOther>
      </TermsOfDelivery>
    </OrderTermsOfDelivery>
    <OrderPaymentInstructions>
      <PaymentInstructions>
        <PaymentTerms>
          <PaymentTerm>
            <PaymentTermCoded>Other</PaymentTermCoded>
            <PaymentTermCodedOther>FRA DATO + 30 dager</PaymentTermCodedOther>
          </PaymentTerm>
        </PaymentTerms>
        <PaymentMethod>
          <PaymentMeanCoded>Other</PaymentMeanCoded>
          <PaymentMeanCodedOther></PaymentMeanCodedOther>
        </PaymentMethod>
      </PaymentInstructions>
    </OrderPaymentInstructions>
    <OrderHeaderNote>#COMMENT#</OrderHeaderNote>
  </OrderHeader>
  
  <OrderDetail>
    <ListOfItemDetail>

#linesXML#

    </ListOfItemDetail>
  </OrderDetail>
  <OrderSummary>
    <NumberOfLines>0</NumberOfLines>
    <TotalAmount>
      <MonetaryValue>
        <MonetaryAmount>0</MonetaryAmount>
        <Currency>
          <CurrencyCoded>NOK</CurrencyCoded>
        </Currency>
      </MonetaryValue>
    </TotalAmount>
  </OrderSummary>
</Order></SOAP-ENV:Body>
</SOAP-ENV:Envelope>